MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F472JETI/mcu.h
/*******************************************************************************
                Bit definition for Peripheral KEYSCAN
*******************************************************************************/
/*  Bit definition for KEYSCAN_SCR register  */
#define KEYSCAN_SCR_KEYINSEL_POS                       (0U)
#define KEYSCAN_SCR_KEYINSEL                           (0x0000FFFFUL)
#define KEYSCAN_SCR_KEYOUTSEL_POS                      (16U)
#define KEYSCAN_SCR_KEYOUTSEL                          (0x00070000UL)
#define KEYSCAN_SCR_CKSEL_POS                          (20U)
#define KEYSCAN_SCR_CKSEL                              (0x00300000UL)
#define KEYSCAN_SCR_CKSEL_0                            (0x00100000UL)
#define KEYSCAN_SCR_CKSEL_1                            (0x00200000UL)
#define KEYSCAN_SCR_T_LLEVEL_POS                       (24U)
#define KEYSCAN_SCR_T_LLEVEL                           (0x1F000000UL)
#define KEYSCAN_SCR_T_HIZ_POS                          (29U)
#define KEYSCAN_SCR_T_HIZ                              (0xE0000000UL)

/*  Bit definition for KEYSCAN_SER register  */
#define KEYSCAN_SER_SEN                                (0x00000001UL)

/*  Bit definition for KEYSCAN_SSR register  */
#define KEYSCAN_SSR_INDEX                              (0x00000007UL)

/*******************************************************************************
                Bit definition for Peripheral MAU
*******************************************************************************/
/*  Bit definition for MAU_CSR register  */
#define MAU_CSR_START_POS                              (0U)
#define MAU_CSR_START                                  (0x00000001UL)
#define MAU_CSR_INTEN_POS                              (1U)
#define MAU_CSR_INTEN                                  (0x00000002UL)
#define MAU_CSR_BUSY_POS                               (3U)
#define MAU_CSR_BUSY                                   (0x00000008UL)
#define MAU_CSR_SHIFT_POS                              (8U)
#define MAU_CSR_SHIFT                                  (0x00001F00UL)

/*  Bit definition for MAU_DTR0 register  */
#define MAU_DTR0                                       (0xFFFFFFFFUL)

/*  Bit definition for MAU_RTR0 register  */
#define MAU_RTR0_SQRT_DOUT                             (0x0001FFFFUL)

/*  Bit definition for MAU_DTR1 register  */
#define MAU_DTR1_SIN_DIN                               (0x00000FFFUL)

/*  Bit definition for MAU_RTR1 register  */
#define MAU_RTR1_SIN_DOUT                              (0x0000FFFFUL)

/*******************************************************************************
                Bit definition for Peripheral MDIO
*******************************************************************************/
/*  Bit definition for MDIO_MDCON register  */
#define MDIO_MDCON_MD_RST_POS                          (0U)
#define MDIO_MDCON_MD_RST                              (0x00000001UL)
#define MDIO_MDCON_MD_PHYB_POS                         (1U)
#define MDIO_MDCON_MD_PHYB                             (0x00000002UL)

/*  Bit definition for MDIO_MDCON1 register  */
#define MDIO_MDCON1_MD_MSDEV_POS                       (0U)
#define MDIO_MDCON1_MD_MSDEV                           (0x00000001UL)
#define MDIO_MDCON1_SEL_EDGE_POS                       (2U)
#define MDIO_MDCON1_SEL_EDGE                           (0x00000004UL)
#define MDIO_MDCON1_MD_EN_POS                          (3U)
#define MDIO_MDCON1_MD_EN                              (0x00000008UL)

/*  Bit definition for MDIO_MDFRM register  */
#define MDIO_MDFRM_MD_ROP_POS                          (0U)
#define MDIO_MDFRM_MD_ROP                              (0x00000003UL)
#define MDIO_MDFRM_MD_ROP_0                            (0x00000001UL)
#define MDIO_MDFRM_MD_ROP_1                            (0x00000002UL)
#define MDIO_MDFRM_MD_RPHYAD_POS                       (2U)
#define MDIO_MDFRM_MD_RPHYAD                           (0x0000007CUL)
#define MDIO_MDFRM_MD_RDEVAD_POS                       (7U)
#define MDIO_MDFRM_MD_RDEVAD                           (0x00000F80UL)
#define MDIO_MDFRM_MD_RTA_POS                          (12U)
#define MDIO_MDFRM_MD_RTA                              (0x00003000UL)
#define MDIO_MDFRM_MD_RTA_0                            (0x00001000UL)
#define MDIO_MDFRM_MD_RTA_1                            (0x00002000UL)

/*  Bit definition for MDIO_MDRXD register  */
#define MDIO_MDRXD_MD_RXD                              (0x0000FFFFUL)

/*  Bit definition for MDIO_MDADR register  */
#define MDIO_MDADR_MD_ADR                              (0x0000FFFFUL)

/*  Bit definition for MDIO_MDTXD register  */
#define MDIO_MDTXD_MD_TXD                              (0x0000FFFFUL)

/*  Bit definition for MDIO_MDPHY register  */
#define MDIO_MDPHY_MD_PHYSW_POS                        (0U)
#define MDIO_MDPHY_MD_PHYSW                            (0x0000001FUL)
#define MDIO_MDPHY_MD_PHYSEL_POS                       (5U)
#define MDIO_MDPHY_MD_PHYSEL                           (0x000003E0UL)
#define MDIO_MDPHY_MD_DEVADD_POS                       (10U)
#define MDIO_MDPHY_MD_DEVADD                           (0x00007C00UL)

/*  Bit definition for MDIO_MDSTA register  */
#define MDIO_MDSTA_MD_WRF_POS                          (0U)
#define MDIO_MDSTA_MD_WRF                              (0x00000001UL)
#define MDIO_MDSTA_MD_ADRF_POS                         (1U)
#define MDIO_MDSTA_MD_ADRF                             (0x00000002UL)
#define MDIO_MDSTA_MD_INCF_POS                         (2U)
#define MDIO_MDSTA_MD_INCF                             (0x00000004UL)
#define MDIO_MDSTA_MD_RDF_POS                          (3U)
#define MDIO_MDSTA_MD_RDF                              (0x00000008UL)
#define MDIO_MDSTA_MD_DEVM_POS                         (4U)
#define MDIO_MDSTA_MD_DEVM                             (0x00000010UL)
#define MDIO_MDSTA_MD_DEVN_POS                         (5U)
#define MDIO_MDSTA_MD_DEVN                             (0x00000020UL)
#define MDIO_MDSTA_MD_PHYM_POS                         (6U)
#define MDIO_MDSTA_MD_PHYM                             (0x00000040UL)
#define MDIO_MDSTA_MD_PHYN_POS                         (7U)
#define MDIO_MDSTA_MD_PHYN                             (0x00000080UL)
#define MDIO_MDSTA_MD_TANM_POS                         (8U)
#define MDIO_MDSTA_MD_TANM                             (0x00000100UL)
#define MDIO_MDSTA_MD_TO_POS                           (9U)
#define MDIO_MDSTA_MD_TO                               (0x00000200UL)
#define MDIO_MDSTA_MD_UDR_POS                          (10U)
#define MDIO_MDSTA_MD_UDR                              (0x00000400UL)
#define MDIO_MDSTA_MD_OVR_POS                          (11U)
#define MDIO_MDSTA_MD_OVR                              (0x00000800UL)
#define MDIO_MDSTA_MD_RBNE_POS                         (12U)
#define MDIO_MDSTA_MD_RBNE                             (0x00001000UL)
#define MDIO_MDSTA_MD_BUSY_POS                         (16U)
#define MDIO_MDSTA_MD_BUSY                             (0x00010000UL)

/*  Bit definition for MDIO_MDIEN register  */
#define MDIO_MDIEN_MD_WRFIE_POS                        (0U)
#define MDIO_MDIEN_MD_WRFIE                            (0x00000001UL)
#define MDIO_MDIEN_MD_ADRFIE_POS                       (1U)
#define MDIO_MDIEN_MD_ADRFIE                           (0x00000002UL)
#define MDIO_MDIEN_MD_INCFIE_POS                       (2U)
#define MDIO_MDIEN_MD_INCFIE                           (0x00000004UL)
#define MDIO_MDIEN_MD_RDFIE_POS                        (3U)
#define MDIO_MDIEN_MD_RDFIE                            (0x00000008UL)
#define MDIO_MDIEN_MD_DEVMIE_POS                       (4U)
#define MDIO_MDIEN_MD_DEVMIE                           (0x00000010UL)
#define MDIO_MDIEN_MD_DEVNIE_POS                       (5U)
#define MDIO_MDIEN_MD_DEVNIE                           (0x00000020UL)
#define MDIO_MDIEN_MD_PHYMIE_POS                       (6U)
#define MDIO_MDIEN_MD_PHYMIE                           (0x00000040UL)
#define MDIO_MDIEN_MD_PHYNIE_POS                       (7U)
#define MDIO_MDIEN_MD_PHYNIE                           (0x00000080UL)
#define MDIO_MDIEN_MD_TANMIE_POS                       (8U)
#define MDIO_MDIEN_MD_TANMIE                           (0x00000100UL)
#define MDIO_MDIEN_MD_TOIE_POS                         (9U)
#define MDIO_MDIEN_MD_TOIE                             (0x00000200UL)
#define MDIO_MDIEN_MD_UDRIE_POS                        (10U)
#define MDIO_MDIEN_MD_UDRIE                            (0x00000400UL)
#define MDIO_MDIEN_MD_OVRIE_POS                        (11U)
#define MDIO_MDIEN_MD_OVRIE                            (0x00000800UL)
#define MDIO_MDIEN_MD_RBNEIE_POS                       (12U)
#define MDIO_MDIEN_MD_RBNEIE                           (0x00001000UL)

/*  Bit definition for MDIO_MDPIN register  */
#define MDIO_MDPIN_MD_PIN                              (0x0000001FUL)

/*  Bit definition for MDIO_MDTO register  */
#define MDIO_MDTO_TOCNT_POS                            (0U)
#define MDIO_MDTO_TOCNT                                (0x0000FFFFUL)
#define MDIO_MDTO_TOEN_POS                             (16U)
#define MDIO_MDTO_TOEN                                 (0x00010000UL)

